Repository: 84000/data-translation-memory
Catalog: toh126-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གསེར་གྱི་བྱེ་མ་ལྟ་བུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Like Gold Dust

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པ་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་མང་པོ་དག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying at Prince Jeta’s Grove, Anāthapiṇḍada’s park in Śrāvastī, along with a great saṅgha of 1,250 monks and many thousands of bodhisattvas.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དཔག་ཏུ་མ་མཆིས་པ་ལགས་སམ།
en: Venerable Ānanda rose from his seat, draped his upper robe over one shoulder, placed his right knee on the ground, and bowing toward the Blessed One with palms pressed together, asked the Blessed One, “Blessed One, are thus-gone, worthy, perfectly complete buddhas limitless?

source: བཅོམ་ལྡན་འདས་ཅི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཡོན་ཏན་དཔག་ཏུ་མ་མཆིས་པ་དང་ལྡན་ལགས་སམ། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed One, do thus-gone, worthy, perfectly complete buddhas possess limitless good qualities?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་དཔག་ཏུ་མེད་དོ། །
en: The Blessed One replied to Venerable Ānanda, “Ānanda, thus-gone, worthy, perfectly complete buddhas are limitless.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་ནོ། །
en: Ānanda, thus-gone, worthy, perfectly complete buddhas possess limitless good qualities.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ལན་གཉིས་སུ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དཔག་ཏུ་མ་མཆིས་པ་ལགས་སམ།
en: Venerable Ānanda then asked the Blessed One a second time, “Blessed One, are thus-gone, worthy, perfectly complete buddhas limitless?

source: བཅོམ་ལྡན་འདས་ཅི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཡོན་ཏན་དཔག་ཏུ་མ་མཆིས་པ་དང་ལྡན་ལགས་སམ།
en: Blessed One, do thus-gone, worthy, perfectly complete buddhas possess limitless good qualities?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ལན་གཉིས་ལན་གསུམ་དུ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་དཔག་ཏུ་མེད་དོ། །
en: The Blessed One replied to Venerable Ānanda a second, and also a third time, “Yes, Ānanda, thus-gone, worthy, perfectly complete buddhas are limitless.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ཡང་ལྡན་ནོ། །
en: Yes, Ānanda, thus-gone, worthy, perfectly complete buddhas possess limitless good qualities.

source: ཀུན་དགའ་བོ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དཔག་ཏུ་མེད་པ་མཉན་པའམ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡུལ་ཤེས་པ་འམ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡོན་ཏན་ཤེས་པར་འདོད་དམ།
en: “Ānanda, do you wish to hear of the limitlessness of thus-gone ones, to know about the range of thus-gone ones, and to know of the good qualities of thus-gone ones?”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དགེ་སློང་རྣམས་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་དུ་གསོལ།
en: “Yes, Blessed One, please teach the monks,” Venerable Ānanda replied.

source: བདེ་བར་གཤེགས་པས་བསྟན་དུ་གསོལ།
en: “Please teach us, Well-Gone One.

source: དགེ་སློང་རྣམས་ཀྱིས་མངོན་སུམ་དུ་ཐོས་ན་ཡང་དག་པར་འཛིན་པར་འགྱུར་ལགས་སོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: If the monks hear it from you directly, they will retain it well.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རྫུ་འཕྲུལ་ཇི་ལྟ་བུས་ཕྱོགས་དང་ཕྱོགས་མཚམས་དག་ཏུ་འགྲོ་བ་ཤེས་སམ།
en: The Blessed One then asked Venerable Ānanda, “Ānanda, do you know the miraculous powers with which Mahāmaudgalyāyana can travel in the cardinal and intermediate directions?”

source: ཀུན་དགའ་བོས་གསོལ་པ།
en: Ānanda replied, “Please tell us, Blessed One.

source: མཽད་གལ་གྱི་བུ་ཆེན་པོ་རྫུ་འཕྲུལ་ཇི་ལྟ་བུས་ཕྱོགས་དང་ཕྱོགས་མཚམས་དག་ཏུ་མཆི་བ་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་དུ་གསོལ།
en: With what miraculous powers does Mahāmaudgalyāyana travel in the cardinal and intermediate directions?

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ལ་དོན་འདི་དཔེས་བསྟན་པར་བྱའོ། །
en: “Ānanda, I will illustrate it for you by means of an analogy,” said the Blessed One.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why?

source: ཀུན་དགའ་བོ་སྐྱེས་བུ་མཁས་པ་གང་དག་དཔེས་དོན་རྟོགས་པར་འགྱུར་བ་ཡོད་པའི་ཕྱིར་རོ། །
en: Because, Ānanda, learned people reach understanding through analogies.

source: ཀུན་དགའ་བོ་དཔེར་ན་རྫིང་དཔག་ཚད་བརྒྱད་སྟོང་པ་ཆུས་གང་བ།
en: Ānanda, take the analogy of a pool measuring eight thousand leagues.

source: བྱ་ཁྭས་བཏུང་དུ་རུང་བར་མུ་དང་ཁ་ད་ཆད་དུ་འདུག་པ།
en: It is so filled with water that a crow can drink from it, it is of equal depth on all sides, and it is covered with lotus leaves.

source: པད་མའི་ལོ་མས་ཁེབས་པ་ཞིག་ཡོད་ལ་དེ་ནས་མི་ལ་ལ་ཞིག་གིས་རླུང་གི་ཤུགས་ལས་འདས་པའི་རྟ་མཆོག་དག་དང་ལྡན་པའི་ལྕགས་ཀྱི་ཤིང་རྟ་ལ་ཞོན་ཏེ།
en: Over this pool someone then rides an iron chariot pulled by fine horses that are stronger than the wind.

source: དེ་ཡང་མུ་ཁྱུད་ཀྱི་ཤིང་ཡང་ཆུ་ལ་མི་རེག །རྟ་རྣམས་ཀྱི་རྨིག་པ་ཡང་ཆུ་ལ་མི་རེག །པད་མའི་ལོ་མ་རྣམས་ཀྱང་རྟའི་རྨིག་པ་དག་གིས་མི་བརྟོལ་བ་ཙམ་གྱི་སྟོབས་དང་ཤུགས་དང་མགྱོགས་པ་དེ་ལྟ་བུས་རྒྱུག་ལ།
en: They race with such power, force, and speed that the wooden rims of the wheels do not even touch the water, nor do the horses’ hooves touch the water, and the lotus leaves are not crushed by the horses’ hooves, not even slightly.

source: ཀུན་དགའ་བོ་དེ་ནས་རྫིང་དེའི་ནང་ནས་སྦྲུལ་གདུག་པ་ཞིག་བྱུང་ནས་ཤིང་རྟ་དེ་མཚོའི་ནང་ནས་ཕྱིར་མ་ལོག་པ་དེའི་བར་སྐབས་སུ་ཤིང་རྟ་དེ་ལན་བརྒྱད་བསྐོར་ན། ཀུན་དགའ་བོ་སྦྲུལ་གདུག་པས་ཤིང་རྟ་ལན་ཅིག་བསྐོར་བའི་ཡུན་ཇི་ཙམ་པ་དེའི་བར་སྐབས་སུ་ཀུན་དགའ་བོ་ཁྱོད་ཆོས་བསྟན་པ་རྣམ་པ་བརྒྱད་སྟོན་ཅིང་དོན་ཀྱང་གོ་བར་བྱེད་དོ། །
en: Ānanda, if a poisonous snake were to appear from that pool and coil itself around the chariot eight times before the chariot had left the lake, well, Ānanda, in the time it took to coil itself just once around that chariot, you can give eight kinds of Dharma teaching and make them understood.

source: ཀུན་དགའ་བོ་ཁྱོད་ཚིག་གཅིག་སྨྲ་བའི་ཡུན་ཇི་ཙམ་པ་དེའི་བར་སྐབས་སུ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཆོས་བསྟན་པ་རྣམ་པ་བརྒྱད་སྟོན་ཅིང་དོན་ཀྱང་གོ་བར་བྱེད་དོ། །
en: But in the time it takes you, Ānanda, to utter one word, Mahāmaudgalyāyana can give eight kinds of Dharma teaching and make them understood.

source: ཀུན་དགའ་བོ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཚིག་གཅིག་སྨྲ་བའི་ཡུན་ཇི་ཙམ་པ་དེའི་བར་སྐབས་སུ་གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་བསྟན་པ་རྣམ་པ་བརྒྱད་སྟོན་ཅིང་དོན་ཀྱང་གོ་བར་བྱེད་དོ། །
en: However, Ānanda, in the time it takes Mahāmaudgalyāyana to utter one word, the elder Śāradvatīputra can give eight kinds of Dharma teaching and make them understood.

source: གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུ་ཚིག་གཅིག་སྨྲ་བའི་ཡུན་ཇི་ཙམ་པ་དེའི་བར་སྐབས་སུ་རང་སངས་རྒྱས་ཆོས་བསྟན་པ་རྣམ་པ་གྲངས་མེད་པ་སྟོན་ཏོ། །
en: Similarly, in the time it takes the elder Śāradvatīputra to utter one word, a pratyekabuddha can give innumerable kinds of Dharma teaching.

source: རང་སངས་རྒྱས་ཚིག་གཅིག་སྨྲ་བའི་ཡུན་ཇི་ཙམ་པ་དེའི་བར་སྐབས་སུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བསྟན་པ་རྣམ་པ་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་བརྗོད་དུ་མེད་པ་སྟོན་ཅིང་དོན་ཀྱང་གོ་བར་བྱེད་དོ། །
en: And in the time it takes a pratyekabuddha to utter one word, a bodhisattva can give unutterably and inconceivably innumerable kinds of Dharma teaching and make them understood.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་ཚིག་གཅིག་སྨྲ་བའི་ཡུན་ཇི་ཙམ་པ་དེའི་བར་སྐབས་སུ་ཀུན་དགའ་བོ་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱད་ཁྲི་འདའོ། །
en: Well, Ānanda, in the time it takes a bodhisattva to utter just one word, the elder Mahāmaudgalyāyana can traverse eighty thousand world systems.

source: ཀུན་དགའ་བོ་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ་དེ་ལྟ་བུའི་འགྲོས་ཀྱིས་ཉིན་མཚན་བདུན་གྱི་བར་དུ་ངལ་མི་བསོ་བར་ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་དུ་འགྲོ་བ་དང་།
en: “Ānanda, imagine if one who has developed such a miraculous ability traveled in this way in the eastern direction for seven days and nights without rest, through however many world systems there may be;

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་།
en: and then, in the same way, traveled to the south, to the west, and to the north;

source: དེ་བཞིན་དུ་ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་མཚམས་དང་། ནུབ་བྱང་གི་མཚམས་དང་། བྱང་ཤར་གྱི་མཚམས་དང་། དེ་བཞིན་དུ་སྟེང་དང་འོག་གི་ཕྱོགས་སུ་ཉིན་མཚན་བདུན་གྱི་བར་དུ་ངལ་མི་བསོ་བར་སོང་ལ།
en: and likewise for seven days and nights without rest to the southeast, to the southwest, to the northwest, the northeast, and likewise in the upward and downward directions.

source: དེ་ནས་མི་ལ་ལ་ཞིག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ར་བས་བསྐོར་ཏེ་ར་བས་བསྐོར་ནས་རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་དང་། གྱོ་དུམ་མེད་པར་བྱས་ཏེ་མཐོན་དམན་མེད་པར་བྱས་ནས་གྲོང་ཁྱེར་གཅིག་ཏུ་བྱས་ལ་གྲོང་ཁྱེར་གཅིག་ཏུ་བྱས་ནས་ཀྱང་ཡུངས་འབྲུས་བཀང་སྟེ་བྱུར་བུར་བྱས་ན།
en: Then, imagine someone enclosed all of those world systems in the ten directions within a fence, and, having leveled the ground and cleared it of rocks, stones, gravel, and debris, made it into a single city, and filled it right to the top with mustard seeds.

source: ཀུན་དགའ་བོ་གྲོང་ཁྱེར་དེའི་ནང་གི་ཡུངས་འབྲུ་ཇི་སྙེད་ཡོད་པ་དེ་དག་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་སེམས་ཅན་བྱང་ཆུབ་ལ་ཞུགས་པ་དག་ངས་མཐོང་ངོ་། །
en: Well, Ānanda, I see beings embarked upon awakening in world systems even more numerous than the number of mustard seeds in that city.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas engaging in bodhisattva conduct.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགའ་ལྡན་གྱི་ལྷའི་རིས་དག་ཏུ་སྐྱེ་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas taking birth among the gods of the Heaven of Joy.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགའ་ལྡན་གྱི་ལྷའི་རིས་དག་ན་འཁོད་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas seated among the gods of the Heaven of Joy.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགའ་ལྡན་གྱི་ལྷའི་རིས་དག་ནས་འཆི་འཕོ་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas dying among the gods of the Heaven of Joy.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མའི་མངལ་དུ་འཇུག་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas entering their mothers’ wombs.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མའི་མངལ་ནས་འབྱུང་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas emerging from their mothers’ wombs.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱིས་པའི་རྩེད་མོ་སྟོན་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas engaged in child’s play.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྒྱལ་སྲིད་སྤངས་ནས་རབ་ཏུ་བྱུང་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas abandoning their kingdoms and going forth as renunciants.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དཀའ་བ་སྤྱོད་པའི་སྦྱོར་བ་སྟོན་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas demonstrating the practice of austerities.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas proceeding towards the seat of awakening.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ལྟ་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas gazing upon the seat of awakening.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་གཅེས་པར་བྱེད་པའི་མཆོག་དང་གུས་པ་ཆེན་པོས་ལན་གསུམ་བསྐོར་བ་བྱེད་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas circumambulating the seat of awakening three times with the utmost devotion and respect.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas seated at the seat of awakening.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ན་འདུག་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas seated before the Bodhi tree.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas who will completely realize unsurpassed and perfectly complete awakening.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see bodhisattvas who have completely realized unsurpassed and perfectly complete awakening.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དག་ངས་མཐོང་ངོ་། །
en: In world systems even more numerous than that, I see blessed buddhas turning the wheel of Dharma.

source: དེ་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་སྟོན་པ་དག་ངས་མཐོང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་མཚན་འཐུན་པ་དང་གདུང་འཐུན་པ་ཤ་སྟག་ཡིན་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མངོན་པར་འབྱུང་བ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ལྟ་བ་དང་།
en: In world systems even more numerous than that, I see blessed buddhas displaying the great parinirvāṇa.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བསྐོར་བ་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དང་། བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ན་འདུག་པ་དང་། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་སྟོན་པ་མཚན་ཐ་དད་པ་དང་གདུང་ཐ་དད་པ་དག་ལྟ་ཅི་སྨོས།
en: “All of these are merely those bodhisattvas with fitting names and fitting family lineages, which is not to mention those great bodhisattvas, in whichever world systems, with different names and different family lineages, who are renouncing, who are proceeding toward the seat of awakening, who are gazing upon the seat of awakening, who are circumambulating the seat of awakening, who are seated at the seat of awakening, who are seated before the Bodhi tree, who are completely awakened and have turned the wheel of Dharma, and who are displaying the great parinirvāṇa.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་གང་དག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མི་འབྱུང་བ་དང་།
en: Venerable Ānanda then asked the Blessed One, “Blessed One, are there any world systems in which blessed buddhas do not appear?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་མི་སྤྱོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་ཅིག་མཆིས་ལགས།
en: Are there any world systems in which bodhisattvas do not engage in bodhisattva conduct?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་ངས་བསྟན་པ་གང་དག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་གང་ཡིན་པ་དེ་དག་ནི་ཀུན་དགའ་བོ་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོའི་བྱེ་མ་དང་གང་གཱའི་ཀླུང་གི་བྱེ་མའི་ནང་ན་གསེར་གྱི་བྱེ་མ་དཀོན་པ་དང་འདྲ་སྟེ།
en: The Blessed One replied, “To draw an analogy Ānanda, in those world systems that I have spoken of, the appearance of blessed buddhas, and bodhisattvas who engage in bodhisattva conduct, is as rare, Ānanda, as gold dust among the sands of the great ocean or the sands of the river Gaṅgā.

source: ཀུན་དགའ་བོ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་གང་དག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ནི་དཀོན་ཏེ།
en: Ānanda, the appearance of blessed buddhas in any world system, and world systems in which bodhisattvas engage in bodhisattva conduct, are as rare as this.

source: ཀུན་དགའ་བོ་ཇི་ལྟར་རྒྱ་མཚོ་ཆེན་པོའི་བྱེ་མ་དང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དེ་དག་ལས་ལ་ལ་ཞིག་གིས་བྱེ་མ་འབྲུ་གཅིག་བླངས་པ་དེ་བཞིན་དུ་གང་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ནི་ཉུང་ངོ་། །
en: Ānanda, world systems in which blessed buddhas appear, and in which bodhisattvas engage in bodhisattva conduct, are as uncommon as someone finding a single grain of gold among all the sands of the great ocean or the sands of the river Gaṅgā.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: Thus spoke the Blessed One, and Venerable Ānanda, together with the monks and bodhisattvas, as well as the world of gods, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.

source: འཕགས་པ་གསེར་གྱི་བྱེ་མ་ལྟ་བུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སྷོ།། །།
en: This concludes the noble Mahāyāna sūtra “Like Gold Dust.”

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེནྡྲ་བོ་དྷི་དང་། པྲཛྙཱ་བརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​། །
en: Translated, edited, and finalized by the Indian preceptors Surendrabodhi and Prajñāvarman, and the chief editor-translator Bandé Yeshé Dé, and others.
